MJBina/LPC/dsPIC/src/common/CAN/rv_can.h
// Service Points for AC Input and Output
#define SPN_MSB81H_RMS_VOLTAGE                   0 
#define SPN_MSB81H_RMS_CURRENT                   1 
#define SPN_MSB81H_FREQUENCY                     2 
#define SPN_MSB81H_OPEN_GROUND                   3 
#define SPN_MSB81H_OPEN_NEUTRAL                  4 
#define SPN_MSB81H_REVERSE_POLARITY              5 
#define SPN_MSB81H_GROUND_FAULT                  6 
#define SPN_MSB81H_PEAK_VOLTAGE                  7 

#define SPN_MSB82H_PEAK_CURRENT                  0 
#define SPN_MSB82H_GROUND_CURRENT                1 
#define SPN_MSB82H_REAL_POWER                    2 
#define SPN_MSB82H_REACTIVE_POWER                3 
#define SPN_MSB82H_HARMONIC_DISTORTION           4 
#define SPN_MSB82H_AC_PHASE_STATUS               5 



// -------------------
// Destination Address
// -------------------
#define RVC_DEST_ADDRESS_ALL            J1939_GLOBAL_ADDRESS  // all destinations

// values used when field is to be ignored
#define RVC_DONT_CHANGE_8BIT     0xFF      // dont change
#define RVC_DONT_CHANGE_16BIT    0xFFFF    // dont change
#define RVC_NOT_SUPPORTED_8BIT   0xFF      // not supported
#define RVC_NOT_SUPPORTED_16BIT  0xFFFF    // not supported

// instance Table 5.3
#define RVC_BROADCAST_INSTANCE   0         // instance used for broadcasting


// -------------------------
// structure packing on
// byte alignement required
// -------------------------
#pragma pack(1)  // structure packing on byte alignment

// ---------------
// inverter status
// ---------------
typedef struct
{
    // RVC 6.20.8 pg 100
    uint8_t     status;     // 0=disabled
    // byte 2
    uint8_t     tempSensorPresent : 2;   // 
    uint8_t     loadSenseEnabled  : 6;   // 
} RVCS_INV_STATUS;  // 2 bytes
STRUCT_SIZE_CHECK(RVCS_INV_STATUS,2);

// ------------------------
// inverter config status 1
// ------------------------
typedef struct
{
    // RVC 6.20.10 pg 101
    uint16_t    loadSensePowerThreshold;    
    uint16_t    loadSenseInterval;          
    uint16_t    minDcVoltShutdown;
    uint8_t     enableFlags;
} RVCS_INV_CFG_STATUS1; // 7 bytes
STRUCT_SIZE_CHECK(RVCS_INV_CFG_STATUS1,7);

// ------------------------
// inverter config status 2
// ------------------------
typedef struct
{
    // RVC 6.20.11 pg 102
    uint16_t    maxDcVoltShutdown;
    uint16_t    minDcVoltWarn;
    uint16_t    maxDcVoltWarn;
} RVCS_INV_CFG_STATUS2; // 6 bytes
STRUCT_SIZE_CHECK(RVCS_INV_CFG_STATUS2,6);

// ------------------------
// inverter dc status
// ------------------------
typedef struct
{
    // RVC 6.20.11 pg 102
    uint16_t    dcVoltage;
    uint16_t    dcAmperage;
} RVCS_INV_DC_STATUS;   // 4 bytes
STRUCT_SIZE_CHECK(RVCS_INV_DC_STATUS,4);

// ---------------
// ac point page 1
// ---------------
typedef struct
{
    // RVC 6.1.2 pg 27
    uint16_t    RMS_Volts;  
    uint16_t    RMS_Amps;           
    uint16_t    frequency;  // 0-500 hz
    // faults byte
    uint8_t     faultOpenGnd     : 2;   // 
    uint8_t     faultOpenNeutral : 2;   // 
    uint8_t     faultRevPolarity : 2;   // 
    uint8_t     faultGndCurrent  : 2;   // 
} RVCS_AC_PNT_PG1;  // 7 bytes
STRUCT_SIZE_CHECK(RVCS_AC_PNT_PG1,7);


// ---------------
// ac point page 2
// ---------------
typedef struct
{
    // RVC 6.1.3 pg 28
    uint16_t    peakVoltage;    // volts    
    uint16_t    peakCurrent;    // amps
    uint16_t    groundCurrent;  // amps
    uint8_t     capacity;       // amps
} RVCS_AC_PNT_PG2;  // 7 bytes
STRUCT_SIZE_CHECK(RVCS_AC_PNT_PG2,7);


// ---------------
// ac point page 3
// ---------------
typedef struct
{
    // RVC 6.1.4 pg 28
    uint8_t     waveformPhaseBits;
    uint16_t    realPower;          // watts
    int16_t     reactivePower;      // +/- VAr
    uint8_t     harmonicDistortion; // percent
    uint8_t     complementaryLeg;   // phase status
} RVCS_AC_PNT_PG3;  // MUST be 7 bytes
STRUCT_SIZE_CHECK(RVCS_AC_PNT_PG3        , 7);


// ---------------
// ac point page 4
// ---------------
typedef struct
{
    // RVC 6.1.5 pg 29
    uint8_t     voltageFault;   // 0=ok, 1=xlo-Volt, 2=lo-Volt, 3=hi-Volt, 4=xhi-Volt, 5=openLine1, 6=openLine2
    // faults byte
    uint8_t     faultSurgeProtect : 2;   // 
    uint8_t     faultHighFreq     : 2;   // 
    uint8_t     faultLowFreq      : 2;   // 
    uint8_t     faultBypassActive : 2;   // 
} RVCS_AC_PNT_PG4;  // MUST be 2 bytes
STRUCT_SIZE_CHECK(RVCS_AC_PNT_PG4        , 2);


// ---------------
// ac fault status
// ---------------
typedef struct
{
    // RVC 6.1.6 pg 30
    uint8_t     extremeLowVoltage;      // exterme low voltage (volts)
    uint8_t     lowVoltage;             // low voltage (volts)
    uint8_t     highVoltage;            // high voltage (volts)
    uint8_t     extremeHighVoltage;     // extreme high voltage (volts)
    uint8_t     equalizationSeconds;    // 0-250 seconds            
    uint8_t     bypassMode;             // 0=normal, 1=bypass mode
} RVCS_AC_FAULT_STATUS_1;   // 6 bytes
STRUCT_SIZE_CHECK(RVCS_AC_FAULT_STATUS_1,6);

// -----------------
// ac fault status 2
// -----------------
typedef struct
{
    // RVC 6.1.7 pg 31
    uint8_t     hiFreqLimit;    // hz
    uint8_t     loFreqLimit;    // hz
} RVCS_AC_FAULT_STATUS_2;   // 2 bytes
STRUCT_SIZE_CHECK(RVCS_AC_FAULT_STATUS_2,2);

// ------------------
// dc source status 1
//  
//  Section 6.20 (Inverter) of the RV-C specification includes a note that says: 
//  "The DC Source Instance does not correspond to the Inverter or Charger 
//  Instance."
//  Section 6.5.2 (DC Source Status 1) includes comments to identify the 
//  instance values in comments below.
// ------------------
typedef struct
{
    // RVC 6.5.2 pg 40
    uint8_t     instance;       // 1=main house battery, 2=chassis start batt, 3=2nd house batt
    uint8_t     devicePriority; // 
    uint16_t    dcVoltage;      // 
    uint32_t    dcCurrent;      // <0=charging
} RVCS_DC_SOURCE_STATUS_1;  // 8 bytes
STRUCT_SIZE_CHECK(RVCS_DC_SOURCE_STATUS_1,8);

// ------------------
// dc source status 2
// ------------------
typedef struct
{
    // RVC 6.5.3 pg 41
    uint8_t     devicePriority; // 
    uint16_t    temperature;    // 
    uint8_t     stateOfCharge;  // 
    uint16_t    timeRemaining;  // 
} RVCS_DC_SOURCE_STATUS_2;  // 6 bytes
STRUCT_SIZE_CHECK(RVCS_DC_SOURCE_STATUS_2,6);

