MJBina/LPC/dsPIC/src/common/CAN/rv_can.h
// ------------------
// dc source status 3
// ------------------
typedef struct
{
    // RVC 6.5.4 pg 42
    uint8_t     devicePriority;     //
    uint8_t     stateOfHealth;      // 
    uint16_t    capacityRemaining;  // 
    uint8_t     relativeCapacity;   // 
    uint16_t    acRmsRipple;        // 
} RVCS_DC_SOURCE_STATUS_3;  // 7 bytes
STRUCT_SIZE_CHECK(RVCS_DC_SOURCE_STATUS_3,7);

// ------------------
// charger status
// ------------------
typedef struct
{
    // RVC 6.21.8 pg 109
    uint16_t    chargeVoltage;  // 
    uint16_t    chargeCurrent;  // 
    uint8_t     chargePercent;  // 
    uint8_t     opState;        // 0=disabled 
    uint8_t     defaultPowerUp; //
} RVCS_CHARGER_STATUS;  // 7 bytes
STRUCT_SIZE_CHECK(RVCS_CHARGER_STATUS,7);

// ----------------------
// charger config status
// ----------------------
typedef struct
{
    // RVC 6.21.8 pg 109
    // byte 1
    uint8_t     chargingAlgorithm;  // 
    // byte 2
    uint8_t     chargerMode;        // 
    // byte 3
    uint8_t     batteryTempSensor  : 2; // 
    uint8_t     chargerInstallLine : 2; //
    uint8_t     batteryType        : 4; // 
    // byte 4,5
    uint16_t    batteryBankSize;    // 
    // byte 6,7
    uint16_t    maxChargeCurrent;   // 
} RVCS_CHARGER_CFG_STATUS;  // 7 bytes
STRUCT_SIZE_CHECK(RVCS_CHARGER_CFG_STATUS,7);

// ----------------------
// charger config status
// ----------------------
typedef struct
{
    // RVC 6.21.12 pg 113
    uint8_t     maxChargeCurrPercent;  // 
    uint8_t     chargeRateLimit;       // 
    uint8_t     shoreBreakerSize;      // 
    uint8_t     defaultBattTemp;       // 
    uint16_t    rechargeVoltage;       // 

    // Not RVC compliant so removed 2017-09-27
    // Sensata extension info
//  uint8_t     sensataStatus;         // status bits
//  uint8_t     sensataErrors;         // error  bits
//  uint8_t     trapErrCode;           // trap error code

} RVCS_CHARGER_CFG_STATUS2; // 6 bytes
STRUCT_SIZE_CHECK(RVCS_CHARGER_CFG_STATUS2,6);

// ---------------------------
// charger equalization status
// ---------------------------
typedef struct
{
    // Ref:		RVC 6.21.18,  rev December 17,2015
	// Name:	CHARGER_EQUALIZATION_STATUS
	// DGN:		1FF99h
    uint16_t    timeRemaining;     // 
    uint8_t     preChargingStatus; // 
} RVCS_CHARGER_EQUAL_STATUS;    // 3 bytes

STRUCT_SIZE_CHECK(RVCS_CHARGER_EQUAL_STATUS,3);

// ---------------
// instance status
// ---------------
typedef struct
{
    // RVC 6.2.4 pg 34
    uint8_t     deviceType;   // 
    uint8_t     baseInstance; // 
    uint8_t     maxInstance;  // 
    uint16_t    baseIntAddr;  // 
    uint16_t    maxIntAddr;   // 
} RVCS_INSTANCE_STATUS; // 7 bytes
STRUCT_SIZE_CHECK(RVCS_INSTANCE_STATUS,7);

// ---------------------
// generic config status
// ---------------------
typedef struct
{
    // RVC 6.3.2 pg 37
    // byte 0
    uint8_t     mfgCodeLSB; // 
    // byte 1
    uint8_t     mfgCodeMSG   : 3; // 
    uint8_t     funcInstance : 5; //
    // byte 2
    uint8_t     function;    // 
    // byte 3
    uint8_t     fwRevision;  // 
    // byte 4
    uint8_t     cfgTypeLSB;  // 
    // byte 5
    uint8_t     cfgTypeISB;  // 
    // byte 6
    uint8_t     cfgTypeMSB;  // 
    // byte 7
    uint8_t     cfgRevision; // 
} RVCS_GENERIC_CFG_STATUS;  // 8 bytes
STRUCT_SIZE_CHECK(RVCS_GENERIC_CFG_STATUS,8);

// ------------------
// diagnostics DM_RV
// ------------------
typedef struct
{
    // RVC 3.2.5.1 pg 12
    // byte 0
    uint8_t     opStatus1    : 2;   // 
    uint8_t     opStatus2    : 2;   // 
    uint8_t     yellowStatus : 2;   // 
    uint8_t     redStatus    : 2;   // 
    // byte 1
    uint8_t     DSA;                // Default Source Address
    // byte 2,3
    uint8_t     SPNmsb;             // Service Point Number (error code)
    uint8_t     SPNisb;             // 
    // byte 4
    uint8_t     FMI          : 5;   // 
    uint8_t     SPNlsb       : 3;   // 
    // byte 5
    uint8_t     occurance    : 7;   // 7Fh if not available
    uint8_t     reserved     : 1;   // always 1
    // byte 6
    uint8_t     DSAextension;       // FFh No DSA extension
    // byte 7
    uint8_t     bankSelect;         // 0-13; 0xF for none

} RVCS_DM_RV;   // 8 bytes
STRUCT_SIZE_CHECK(RVCS_DM_RV,8);

#pragma pack()  // restore packing setting

// -----------
// Prototyping
// -----------
void rvcan_Send_DM_RV(void);
void rvcan_SendGenericCfgStatus(void);
void rvcan_SendProductID(uint8_t* MakeModelSnUnit);
int  IsRvcCmdForMe(uint8_t instance);
void rvcan_BuildProductId(void);
uint8_t* rvcan_GetProductIdString(void);
void rvcan_SendMfgAddressClaimRequest(uint16_t mfgCode);
void rvcan_SendCommStatus1(void);
void rvcan_SendCommStatus2(void);
void rvcan_SendCommStatus3(void);
void rvcan_SendDcSourceStatus1(void);
void rvcan_SendDcSourceStatus2(void);
void rvcan_SendDcSourceStatus3(void);
void rvcan_SendInverterStatus(void);
void rvcan_SendInverterConfigStatus1(void);
void rvcan_SendInverterConfigStatus2(void);
void rvcan_SendInverterDcStatus(void);
void rvcan_SendInverterAcFaultCfgStatus1(void);
void rvcan_SendInverterAcFaultCfgStatus2(void);
void rvcan_SendInverterAcStatus1(void);
void rvcan_SendInverterAcStatus2(void);
void rvcan_SendInverterAcStatus3(void);
void rvcan_SendChargerStatus(void);
void rvcan_SendChargerConfigStatus(void);
void rvcan_SendChargerConfigStatus2(void);
void rvcan_SendChargerEqualStatus(void);
void rvcan_SendChargerAcFaultCfgStatus1(void);
void rvcan_SendChargerAcFaultCfgStatus2(void);
void rvcan_SendChargerAcStatus1(void);
void rvcan_SendChargerAcStatus2(void);
void rvcan_SendChargerAcStatus3(void);
void rvcan_SendChargerAcStatus4(void);
void rvcan_InverterCmd(uint8_t enableFlags, uint8_t startupFlags);
void rvcan_InverterCfgCmd1(uint16_t loadSenseThresh,     // power threshold in watts
                    uint16_t loadSenseInterval,  // seconds
                    uint16_t dcSrcShutdownMin);  // volts
void rvcan_InverterCfgCmd2(uint16_t dcSrcShutdownMax,    // volts
                    uint16_t dcSrcWarnMin,       // volts
                    uint16_t dcSrcWarnMax);      // volts
void rvcan_InverterAcFaultCtrlCfgCmd1(RVCS_AC_FAULT_STATUS_1* cfg);
void rvcan_InverterAcFaultCtrlCfgCmd2(RVCS_AC_FAULT_STATUS_2* cfg);
void rvcan_ResetCommStats(void);
void rvcan_GeneralReset(uint8_t isReboot,            // 0=no, 1=reboot cpu
                        uint8_t isClearFaults,       // 0=no, 1=clear faults
                        uint8_t isRestoreDefaults,   // 0=no, 1=restore to default values
                        uint8_t isResetCommStats);   // 0=no, 1=reset communication statistics
void rvcan_SendInstanceStatus(void);
void rvcan_InstanceAssignment(uint8_t deviceType, uint8_t baseInstance,
                              uint8_t maxInstance,uint16_t baseIntAddr,uint16_t maxIntAddr);
void rvcan_ChargerCmd(uint8_t status,         // 0=off, 1=on, >1=dont change
               uint8_t state_on_power_up);    // 0=charger disabled, 1=charger enabled
void rvcan_ChargerCfgCmd(uint8_t  chargingAlgorithm,     // 
                  uint8_t  chargerMode,          // 
                  uint8_t  batterySensePresent,  // 0=no, 1=yes
                  uint8_t  installationLine,     // 0=line1, 1=line2
                  uint16_t batteryBankSize,      // amp-hours; resolution 1 amp-hour
                  uint16_t batteryType,          // 
                  uint8_t  maxChargingCurrent);  // amps
void rvcan_ChargerCfgCmd2(uint8_t  chargePercent,        // max charge current; percent
                   uint8_t  chargeRatePercent,   // charge rate limit; percent of bank size
                   uint8_t  breakerSize);        // amps
void rvcan_ChargerEqualizationCmd(uint16_t  equalizationVolts,       // equalization voltage
                           uint16_t  equalizationMinutes);   // equalization time in minutes
void rvcan_ChargerAcFaultCtrlCfgCmd1(RVCS_AC_FAULT_STATUS_1* cfg);
void rvcan_ChargerAcFaultCtrlCfgCmd2(RVCS_AC_FAULT_STATUS_2* cfg);
void rvcan_SendPropInvStatus(uint8_t loDGN);
int16_t rvcan_Dispatcher(CAN_MSG* msg);


#endif // _RV_CAN_H_

// <><><><><><><><><><><><><> rv_can.h <><><><><><><><><><><><><><><><><><><><><><>
